[
  
    {
      "title"    : "Staticman with Gitlab",
      "category" : "Staticman",
      "content"	 : "         Use staticman For Gitlab CommentsTaken From Zong Ren’s blog  Create a staticmanapp  Create a trigger  Create a webhookStaticman is a very handy static blog commenting implementation, but unfortunately only supports github and jekyll, but using staticman on gitlab pages is possible by using the github webhooks and gitlab triggers features.Create staticmanappThe first step is to create staticman app, according to the official document operation, you can also view the repository I created .Create a triggerSelect in the gitlab project menu Triggers &amp;gt; Add triggerand copy the link belowcurl -X POST      -F token=TOKEN      -F ref=REF_NAME      https://gitlab.com/api/v3/projects/1400576/trigger/buildsCreate a webhookClick on the github project Settings&amp;gt;Webhooks&amp;gt;Add webhook, Payload URL fill in the link above and add parameters, for examplehttps://gitlab.com/api/v3/projects/1400576/trigger/builds?token=5e763611ads5fb89598220414e334b&amp;amp;ref=masterNotice that the token is replaced",
      "url"      : "//posts/2018-03-05-post-Staticman-with-Gitlab/",
      "date"     : "2018-03-05 17:16:01 -0500"
    },
  
    {
      "title"    : "Jekyll Admin",
      "category" : "Jekyll",
      "content"	 : "         Jekyll Admin for Local HostCannot stop myself from opening VS 2017 to do work. When I get it down I will be doing alot of bundle exec jekyll serve and then going to my root and going to Jekyll Admin to build my sites as /admin.Jekyll admin makes it so easy for me to add new pages, posts or any type of content, including file management, adding images to .md pages and Changing Configuration.Adding more to this post as it will continue to develop.",
      "url"      : "//posts/2018-02-26-post-Jekyll-Admin/",
      "date"     : "2018-02-26 17:16:01 -0500"
    },
  
    {
      "title"    : "Windows Tweaks",
      "category" : "Windows",
      "content"	 : "         Windows 10, 8, 7, Vista, XpBasic Tweaks Sites:TweakHounds, PcTuneUpTips,H Enthusiasts,Windows FanaticsWindows Fanatics at TechNetTech Net 1, Tech Net 2, Tech Net 3Below is My testing and Opinions, “try at you own risk”.I tried all the below.Advanced System SettingsGo to Control Panel, Click System, Go to advanced System settings in left pane, click on system property’s, it will come up in a new Window, click on the advanced tab and click on Performance,  and new Window saying Performance options will appear, click on advanced tab, make sure it is not set to background services = set it to programs.Virtual MemoryAlso on the Advanced tab for Virtual Memory click the Change button and  a new window will again pop up, click on Custom size button, type in the initial size as 4069 and in the Maximum size type 8069 and then click set, you can do this for more than one drive, and the maximum size can be at 3 times the amount of RAM installed on your computer. If you see warnings at these Windows Vista recommended levels, then increase the minimum and maximum sizes.Vista SP1 changes this to allot of different Values, some sites suggest not to set this to custom and let Windows decide Virtual Memory settings,  OK, they said that about XP also, but I found setting this to the max and on multiple drives increases performance and in XP if you reboot several times and then set it back o System Managed size it will increase the normal System management and size of page filing by letting Windows decide Virtual Memory settings, kind of tricks Windows into increasing this value, through its own Management. I leave it on custom, and to the MAX.My second partition I set to 2069 and 4069 which was the best min &amp;amp; max for XP Pro 32 bit. CAUTION, the above Virtual Memory setting is for 64 bit machines. Initial minimum: 1536 or 3072 or 4096 Maximum:, is max in X86 32 bit XP Machines. Some Vista Tweak’s web sites recommend Disabling Virtual Memory, I don’t know what they are smoking, but I don not recommend sharing whatever they are puffing on or Disabling Virtual Memory.TopAdvanced Visual EffectsGo to the Visual effects tab and click on CUSTOM = click on Desktop compression, smooth screen fonts, Folder background images, drop shadows, visual styles = which will still give you the Vista look without the Glass which eats up system resources along with allot of visual additions not really needed, You can play with this for the look you want.Turn on DEP for programs except the ones you choose = add only X86 32 bit programs as it will not let you choose any  X64  programs, make sure to find the .exe files for your specific trusted programs in Program Files x86 in explorer.On remote tab uncheck allow remote assistance unless needed = this allows Microsoft or anyone access to your computer.Close out all windows and Restart Computer = VS Express and SQL express problem  fixed and/or and 64 bit slowness or problems.Page Filing was = 2063, now 6118 on two drives.Defragment Boot SectorDefragment Your Hard Drives after a new Upgrades, “before doing anything else”. Defragment after installation or un-installations of several Programs or if they are very large = a good example is Visual Studio, Office suites and others. Defrag after updates and after moving or copying allot of files.Is Windows Vista taking a long time to startup? You can try defragmenting the boot files by using the Command Prompt in Windows Vista.1. Go to Start/All Programs/Accessories/Command Prompt2. At the prompt, type defrag c: -bDisk Defragmenter does not defragment files in the Recycle Bin. It is best to run Disk Cleaner first and then empty the Recycle Bin, before defragmentingDisk Defragmenter will also not defragment files which are in use. Best to try and shut down as many processes as possible and then defragment.Disk Defragmenter does not defragment the following files: Bootsect DOS, Safeboot fs, Safeboot csv, Safeboot rsv, Hiberfil sys, Memory dmp and the Windows page file. However using the -b parameter, as mentioned below, will optimize the boot files.Disk defragmenter Command line optionsThere are various command line options for you to exercise control over the defragmentation process.To defrag a specific drive, say Drive C, open a command prompt and type:defrag c: -vDoing it verbos instead of with the numbering systemDisk Defragmenter does not defragment files in the Recycle Bin. It is best to run Disk Cleaner first and then empty the Recycle Bin, before defragmentingYou can use the following parameters or switches with the Defrag command to further fine-tune your control:-r  This is the default setting and defragments file fragments that less than 64 MB.-a  Analyze the selected drive / volume &amp;amp; display a summary report, consisting of analysis and defragmentation reports.-c  Defragments all volumes on the computer. Don’t specify a drive letter while using this.-w  Perform FULL defragmentation of files of ALL sizes.-f  Forced defragmentation even when there is less amount of free space on the drive being defragmented. A volume must have at least 15 % free space before Disk Defragmenter can completely defragment it.-i  This makes Defrag run in the background &amp;amp; operate only if the computer is idle, like when run as a scheduled task.-v  Displays complete reports.-b  It optimizes boot files and applications only.The only indication you will get is a blinking cursor. This means that the process is going. To interrupt the defragmentation process, press Ctrl + C in the command window.You can read more here on Defrag Options &amp;amp; Command line switches.Defragmenter does not runIf you find that you are unable to defragment or cannot run the defragment utility in Windows or that a drive or volume has been marked  as having errors, run chdsk by enteringchkdsk c: /f at any command prompt; where c is the drive letter. You will be able to then run Defrag after Chkdsk has repaired the file system. If you still face problems, seee this post on Disk defragmenter could not start or Failed to initialize.In Windows 8, while the  is good enough for most of us, there are some who prefer to use Free Defragmentation Software. You may want to have a look at these too.Or any drive letter. The below is some different ways to defrag from command prompt.defrag c:defrag c:volmountpoint -w -fdefrag c: -a -vdefrag -c -v3. Exit Dos Window when defrag has completed., you will see the original prompt when it is finished = as in mine it’s C:UsersdonboultonTopClear temp filesGo to start then click run, and type in the test field %temp% and hit enter. When it open up highlight all temp files and delete.32 &amp;amp; 64 bit ExplorerFor all that are having Flash and SilverLight problems.In Vista X64 you should have two versions of Internet Explorer a 32 bit version and a 64 bit version the 32 bit allows you to view Flash and SilverLight if installed while using your X86 = 32bit IE. You can forget using Flash and SilverLight on X64 and I do not see it coming soon. P. S. you do not need any other browsers like Firefox unless you want it for some reason. Firefox and all Mozilla and AOL browsers eat up your memory, and you cannot get it back by closing out these programs, you have to restart your computer.You can Turn off UAC if you are the only one using your computer UAC is a pain, and if are the only one using your computer it should not be needed. Go To Start &amp;gt; Control Panel &amp;gt; User Accounts, Administrator Account &amp;gt;  At the Bottom of the left list click turn User Account Control on or off &amp;gt; New Window, uncheck UAC and click OK &amp;gt; Reboot, and/or restart computer for these setting to take effect.RegeditVista Registry Fixes,  on classic start menu, go to start and then run and type in the text box field regedit.exe and click OK, or enter on keyboard.Caution the below is for Experts only! Pay attention to what you are doing and details.Some tweaks Curtsey of  Regedit Tweaks below. and the links to the details on how to do each one of them below.A ADDED VALUE!Turned off DefenderLinks for regedit below.Added registry entry for 32 bit not 64 bit[Path: [HKEY_LOCAL_MACHINESOFTWAREPoliciesMicrosoft]Location: Local MachineValue Name: Windows DefenderData Type: Key Enabled Value:Disabled Value:Action Type: Add an Entry Path: [HKEY_LOCAL_MACHINESOFTWAREPoliciesMicrosoftWindows Defender]Location: Local MachineValue Name: DisableAntiSpyware Data Type: DWORD (DWORD Value)Enabled Value: 1 &amp;gt;Disabled Value: 0Action Type: Add an Entry](http://www.liutilities.com/products/registrybooster/tweaklibrary/tweaks/11423/)A Changed Value!Processor SchedulingI set to 12Path: [HKEY_LOCAL_MACHINESystemCurrentControlSetControlPriorityControl]Location: Local MachineValue Name: Win32PrioritySeparationData Type: DWORD (DWORD Value)Enabled Value: 12Disabled Value: 26Action Type: ModifiedTopA Changed Value!Level 2 Cash settingsProcessor SettingsSet to 400 for L2 1024 was 0 = HAL was sick.L2 common settings 80 for 128, 100 for 256, 200 for 512, 400 for 1024 and so on. Hal not reading AMD 64 X2 Level 2 cash.Most Xp and Vista Machines have this setting to 0 Check AMD or Intel for you processor L2 cash and set this value accordingly.Path: [HKEY_LOCAL_MACHINESYSTEMCurrentControlSetControlSession ManagerMemory Management]Location: Local MachineValue Name: SecondLevelDataCacheData Type: DWORD (DWORD Value)Enabled Value: 80 / 100 / 200Disabled Value: 0Action Type: ModifiedSuperfetcher BehaviorA Changed Value!Superfetch is a new feature in window since vista that understands which applications you use most, and preloads these applications into memory, so your system is more responsive. Superfetch uses a complex prioritization scheme that can even differentiate which applications you use most often and when you use them. Now, you can change the way that superfetch behaves by making a change in the registry. This is helpful when you want to alter superfetch or disable superfetch completely.For this, go to start &amp;gt; run menu, enter regedit and navigate to the registry path listed below. Now, right-click and modify the dword value enable prefetcher, in the right panel, to the suitable value given above. However, if you want to get the default value back, change the value data to 2. The changes take effect after a restart or logoff.My value was 3, I changed it to 1 as stated below!Set a user defined value like “1” to alter the behavior of Prefetcher and click ‘OK’.Path: [HKEY_LOCAL_MACHINESYSTEMCurrentControlSetControlSession ManagerMemory ManagementPrefetchParameters]Location: Local MachineValue Name: EnableSuperfetchData Type: DWORD (DWORD Value)Enabled Value:Disabled Value:Action Type: ModifiedTopPrefetcher BehaviorA Changed Value!Change the behavior of Prefetcher = I set it to 1 was set to 3. Still allot of files in prefetch = 45MB after a couple of restarts it is only 32 MB setting’s after registry tweak below. Prefetch size depends on how many programs you have used in Vista and how often they are used. If you have installed programs you no longer use or rarely use some programs, Vista puts some parts of these programs in the Windows &amp;gt; Prefetch folder and then loads them into memory for faster startup of these commonly used programs and sometimes all previously used programs. At startup the size of  the contents of this folder is taken out of you memory size so if it is 48MB it come off of your 2GB or whatever, right at startup. You can delete all the contents of this folder except the Sub-Folder named ReadyBoot = do not mess with this folder or its contents. If you use allot of Different Programs and do not like waiting for them to startup, do not change these values, as some delay in starting these programs could occur. If you have allot of Memory then I would not change these values like 4GB or more of RAM.Prefetcher in most of the sites and tweaks you will find that they suggest that you do not mess with this feature, but it worked great for me. Tweak It for less memory usage.Path: [HKEY_LOCAL_MACHINESYSTEMCurrentControlSetControlSession ManagerMemory ManagementPrefetchParameters]Location: Local Machine Value Name: EnablePrefetcherData Type: DWORD (DWORD Value)Enabled Value:Disabled Value:Action Type: Modified     A ADDED VALUE!Turn off NV CacheTurn off for faster boot and resume time feature.Added registry entry for 32bit not 64 bitPath: [HKEY_LOCAL_MACHINESOFTWAREPoliciesMicrosoftWindows]Location: Local MachineValue Name: NvCacheData Type: Key Enabled Value:Disabled Value: Action Type:Add an Entry Path: [HKEY_LOCAL_MACHINESOFTWAREPoliciesMicrosoftWindowsNvCache] Location: Local Machine Value Name: OptimizeBootAndResumeData Type: DWORD (DWORD Value) Enabled Value: 0Disabled Value: 1Action Type: Add an EntryTopMore Registry, TweaksGet rid of the shortcut arrow on the Vista desktop. Frameworkx, it work’s.A Changed Value!Tweak for the Registry Desktop Icon. The Icon Size is to large, my registry size was 36, I set it to 16. Worked great for me. I have dual 32 inch HDTV monitors with 1366 X 786 display resolutions so the icons are now a tolerable size. Smaller displays and resolutions 16 might be to small, and 16 is the smallest size, if you set it smaller than 16 will default and reset to 16.“HKEY_CURRENT_USERControl PanelDesktopWindowMetrics” and the key is “Shell Icon Size” was set at 36, I set it to 16.A trick to change Icon sizes that works till reboot is. While on your desktop, hold down the CTRL key and scroll your mouse up for larger and down for smaller icons.  You can make your icons very small or extremely large.Rename Recycle BinTo whatever you want.Navigate to the following branch:HKEY_CURRENT_USER  Software  Microsoft  Windows  CurrentVersion  Explorer  CLSID  {645FF040-5081-101B-9F08-00AA002F954E}Double-click (default) and replace the existing text (“Recycle Bin”) with your preferred text.TopChange Desktop Icon SpacingChanging Desktop Icon Spacing in Vista, “ALL Versions”, adjustments can be made to horizontal and vertical alignment spacing.Steps for spacing desktop icons horizontal and vertical. Also you can change Desktop, Explorer and Most Vista Program Fonts and sizes here also.**1. Right Click Desktop + Choose “Personalize”2. At the top + Choose “Window Color and Appearance”.3. In the Window Color and Appearance Window, go to the bottom and click + Open classic appearance properties for more color options.4. In the Appearance Settings Window choose + Advanced.5. In the Advanced Appearance + Choose Item and select Icon Spacing (Horizontal) and to the right of the Item selection set the + spacing you desire =  Repeat this step 5 for Icon Spacing (Vertical), Then click OK in the Advanced Appearance Window , and the click Apply and then OK in the Appearance Settings Window and close the Personalization window and you are done.I made the choice 16 for Horizontal and 30 for Vertical mainly because Recycle bin overlaps the bottom of other icons because of its large size, even though I made it smaller as in the above Visual Tweaks section of this document or you can put it on top or other icons and change Vertical to what ever works, CAUTION do not overlap icons as when you click on them it will activate both that are overlapped. Note this will change Icon spacing in Explorer also.  You will notice the size and spacing in the Print Screen of my desktop on bottom right next to the sidebar.    TopA Changed Value!For Indexing problems,Or indexing will not start or stay running. = Indexing and search are file renaming problemsSet the registry value HKEY_LOCAL_MACHINESOFTWAREMicrosoftWindows SearchSetupCompletedSuccessfully ( set it to 0 and try restarting the Windows Search service.See this post in MSDNIf you want Multiple Operating Systems and Windows or DOS boot manager is not working for you or there is dual boot problems or Vista gets confused with the 32 bit OS. Then Install each on a different Hard Drive = “not a partition”, and install the OS 32 bit or 64 bit on the Drive that does not have Vista 32 bit or 64 bit installed on it.You have to shut down computer and unplug the drive you have Vista on, or visa versa if you have installed Vista already. Then start up your computer and hit delete or escape and go to the BIOS and set the drive you want to install as boot drive and clear the drive vista was on. This creates a situation where if you want to change OS’s you have to go to BIOS each time and select the drive you want. There are allot of different bios’s so you will have to know somewhat how to do this on your machine.If you set them up in BIOS where they are complete different separate OS’s there is some advantages and the only disadvantage is having to go to the Bios each time to change OS’sNow my Vista Home Premium is smoking Fast and stable, quick startup and shutdown, but renaming files in explorer and some moving of files is still slow = Microsoft has not fixed this for their own Vista Computers!If you use the Windows Explorer shortcut on your Start Menu, you probably notice that it always opens in the same window. For example, if you use Windows Vista, Windows Explorer always opens to the Documents folder.If you find this to be an annoyance, Explorer always opening to the Documents folder, you can configure it to open to a folder of your choice. You can do so by editing the properties of the Windows Explorer shortcut.Open Windows Explorerand locate your Start Menu folder. Right click the shortcut to Windows Explorer and click Properties. From the Shortcut tab, change the target so it reads as follows: %systemroot%explorer.exe /n, /e, x:folder where x:folder is the path to the folder that you want Explorer to open in. Click OK. Now when you launch Windows Explorer from the Start Menu, it will open in the folder that you specified.This is located in my computer in the Explorer Location Bar at:Explorer Location BarJust click your Explorer location Bar and it will give you the Exact Location.For this to Work you have to put a shortcut to Windows Explorer on your desktop, it will not work if you right click on the start bar button and click on explorer it goes to its default location.YOU CAN PUT AS MANY OF THESE EXPLORER SHORTCUTS ON YOU DESKTOP AS YOU WANT.Make sure after you create each one you rename it. I call One D for D Drive I call on Doc for documents on another Drive or Folder that My Documents are stored; est.Right Click the Explorer shortcut and a drop down list will appear go to send to and create a shortcut to the desktop.Then you will see the shortcut to Windows Explorer, right click on it and you will see target, change you link in this field.The Shortcut I used was to a different drive, as in drive D: = I changed it to = %SystemRoot%explorer.exe /n /e, D:DownloadsIf you mess up it will default to its original location.Sometimes if you use a different drive as explained above for Loading Multiple OS’s you can save files, and all downloads on that separate Hard drive that gives you ability or can help eliminate the problems of downloading infected files and malware, thus helping separate from your OS from infection.This can be done in my system to %SystemRoot%explorer.exe /n, /e, E:Downloads, or whichever drive letter you have for the separate Hard Drive and/or Partition’s, better on a separate Hard Drive.Thanks To:, Dana Huggins at Windows Fanatics.                                                                                                  Windows XP, Vista, Windows 10.  ",
      "url"      : "//2018-02-26-post-Windows-Tweaks/",
      "date"     : "2018-02-26 17:16:01 -0500"
    },
  
    {
      "title"    : "Defrag SQL",
      "category" : "Programing",
      "content"	 : "         Defragment SQL ServerIn any SQl database and one that updates through migrations like Orchard CMS get defragmented and I have notice over the years dealing with SQL server that it needs defraging occasionaly, keeping the performance optimized.I have included this in my blog as a notice to pay attention and defrag your SQL database.Microsoft PostMicrosoft DocsIt’s been quite some time since my last index defrag script update. A big part of the reason for that is because I wanted to implement many of the suggestions I’ve received, but I just haven’t had the time. I still have those changes planned, but I’m not sure quite when I’ll get to it. Rather than continue to wait for a major release, I’m releasing a small update to my defrag that will take care of the most common complaints I receive.Change Log  Bug fix for databases containing spaces or special characters  Support for case-sensitive databases  Re-executable CREATE script (for those who want to re-run the whole script)  Comma-delimited list of databases is now supported for the @database parameterFeature List:  Defrag a single database, a list of databases, or all databases (@database)  Time Limitations: stop defragging after the specified amount of time has elapsed (@timeLimit). Please note, it will not kill a defrag that is currently in process, even if it exceeds the threshold.  Optional stop-and-resume functionality: pick up where your defrag last left off without having to rescan sys.dm_db_index_physical_stats. (@forceRescan)  Defrag scheduling: choose which days to defrag certain indexes, or exclude certain indexes altogether, by using the dbo.dba_indexDefragExclusion table.  Defrag priority: choose whether to defrag indexes in ascending or descending order by range_scan_count (default), fragmentation, or page_count.  Current partition exclusion: choose whether or not to exclude the right-most populated partition from the defrag process, common for sliding-window tables (@excludeMaxPartition)  Commands-only mode: Choose to just log the current defrag status and print the defrag commands, rather than executing them, by using @executeSQL.  … and tons more! Please read the parameter list and notes section for details of all the options available.FAQ:I often receive the same questions about this script, so allow me to answer them here:I keep running the script, but my index is still fragmented. Why?This is most likely a very small index. Here’s what Microsoft has to say:In general, fragmentation on small indexes is often not controllable. The pages of small indexes are stored on mixed extents. Mixed extents are shared by up to eight objects, so the fragmentation in a small index might not be reduced after reorganizing or rebuilding the index. For more information about mixed extents, see Understanding Pages and Extents.What database should I create it in? or Can I create this in the MASTER database? It’s up to you where you create it. You could technically create it in the MASTER database, but I recommend creating a utility database for your DBA administrative tasks.Can I run this against a SharePoint database?Yes, you can.What are the minimum requirements to run this script? or Will this run on SQL Server 2000 instances?You need to be on SQL Server 2005 SP2 or higher.SQL Server 2008 R2 or higher/*Perform a &#39;USE &amp;lt;database name&amp;gt;&#39; to select the database in which to run the script.*/  -- Declare variables  SET NOCOUNT ON;  DECLARE @tablename varchar(255);  DECLARE @execstr   varchar(400);  DECLARE @objectid  int;  DECLARE @indexid   int;  DECLARE @frag      decimal;  DECLARE @maxfrag   decimal;  -- Decide on the maximum fragmentation to allow for.  SELECT @maxfrag = 30.0;  -- Declare a cursor.  DECLARE tables CURSOR FOR     SELECT TABLE_SCHEMA + &#39;.&#39; + TABLE_NAME     FROM INFORMATION_SCHEMA.TABLES     WHERE TABLE_TYPE = &#39;BASE TABLE&#39;;  -- Create the table.  CREATE TABLE #fraglist (     ObjectName char(255),     ObjectId int,     IndexName char(255),     IndexId int,     Lvl int,     CountPages int,     CountRows int,     MinRecSize int,     MaxRecSize int,     AvgRecSize int,     ForRecCount int,     Extents int,     ExtentSwitches int,     AvgFreeBytes int,     AvgPageDensity int,     ScanDensity decimal,     BestCount int,     ActualCount int,     LogicalFrag decimal,     ExtentFrag decimal);  -- Open the cursor.  OPEN tables;  -- Loop through all the tables in the database.  FETCH NEXT     FROM tables     INTO @tablename;  WHILE @@FETCH_STATUS = 0  BEGIN  -- Do the showcontig of all indexes of the table     INSERT INTO #fraglist      EXEC (&#39;DBCC SHOWCONTIG (&#39;&#39;&#39; + @tablename + &#39;&#39;&#39;)         WITH FAST, TABLERESULTS, ALL_INDEXES, NO_INFOMSGS&#39;);     FETCH NEXT        FROM tables        INTO @tablename;  END;  -- Close and deallocate the cursor.  CLOSE tables;  DEALLOCATE tables;  -- Declare the cursor for the list of indexes to be defragged.  DECLARE indexes CURSOR FOR     SELECT ObjectName, ObjectId, IndexId, LogicalFrag     FROM #fraglist     WHERE LogicalFrag &amp;gt;= @maxfrag        AND INDEXPROPERTY (ObjectId, IndexName, &#39;IndexDepth&#39;) &amp;gt; 0;  -- Open the cursor.  OPEN indexes;  -- Loop through the indexes.  FETCH NEXT     FROM indexes     INTO @tablename, @objectid, @indexid, @frag;  WHILE @@FETCH_STATUS = 0  BEGIN     PRINT &#39;Executing DBCC INDEXDEFRAG (0, &#39; + RTRIM(@tablename) + &#39;,        &#39; + RTRIM(@indexid) + &#39;) - fragmentation currently &#39;         + RTRIM(CONVERT(varchar(15),@frag)) + &#39;%&#39;;     SELECT @execstr = &#39;DBCC INDEXDEFRAG (0, &#39; + RTRIM(@objectid) + &#39;,         &#39; + RTRIM(@indexid) + &#39;)&#39;;     EXEC (@execstr);     FETCH NEXT        FROM indexes        INTO @tablename, @objectid, @indexid, @frag;  END;  -- Close and deallocate the cursor.  CLOSE indexes;  DEALLOCATE indexes;  -- Delete the temporary table.  DROP TABLE #fraglist;  GOSQL 2005 - 2008 codeOriginally created by Microsoft Error corrected by Pinal DaveCheck FragmentationDBCC INDEXDEFRAG(    { database_name | database_id | 0 }     , { table_name | table_id | view_name | view_id }     [ , { index_name | index_id } [ , { partition_number | 0 } ] ])    [ WITH NO_INFOMSGS ]SQL Server DBCC INDEXDEFRAG codePerform a &#39;USE &amp;lt;database name&amp;gt;&#39; to select the database in which to run the script.*/-- Declare variablesSET NOCOUNT ON;DECLARE @tablename varchar(255);DECLARE @execstr   varchar(400);DECLARE @objectid  int;DECLARE @indexid   int;DECLARE @frag      decimal;DECLARE @maxfrag   decimal;-- Decide on the maximum fragmentation to allow for.SELECT @maxfrag = 30.0;-- Declare a cursor.DECLARE tables CURSOR FOR   SELECT TABLE_SCHEMA + &#39;.&#39; + TABLE_NAME   FROM INFORMATION_SCHEMA.TABLES   WHERE TABLE_TYPE = &#39;BASE TABLE&#39;;-- Create the table.CREATE TABLE #fraglist (   ObjectName char(255),   ObjectId int,   IndexName char(255),   IndexId int,   Lvl int,   CountPages int,   CountRows int,   MinRecSize int,   MaxRecSize int,   AvgRecSize int,   ForRecCount int,   Extents int,   ExtentSwitches int,   AvgFreeBytes int,   AvgPageDensity int,   ScanDensity decimal,   BestCount int,   ActualCount int,   LogicalFrag decimal,   ExtentFrag decimal);-- Open the cursor.OPEN tables;-- Loop through all the tables in the database.FETCH NEXT   FROM tables   INTO @tablename;WHILE @@FETCH_STATUS = 0BEGIN-- Do the showcontig of all indexes of the table   INSERT INTO #fraglist    EXEC (&#39;DBCC SHOWCONTIG (&#39;&#39;&#39; + @tablename + &#39;&#39;&#39;)       WITH FAST, TABLERESULTS, ALL_INDEXES, NO_INFOMSGS&#39;);   FETCH NEXT      FROM tables      INTO @tablename;END;-- Close and deallocate the cursor.CLOSE tables;DEALLOCATE tables;-- Declare the cursor for the list of indexes to be defragged.DECLARE indexes CURSOR FOR   SELECT ObjectName, ObjectId, IndexId, LogicalFrag   FROM #fraglist   WHERE LogicalFrag &amp;gt;= @maxfrag      AND INDEXPROPERTY (ObjectId, IndexName, &#39;IndexDepth&#39;) &amp;gt; 0;-- Open the cursor.OPEN indexes;-- Loop through the indexes.FETCH NEXT   FROM indexes   INTO @tablename, @objectid, @indexid, @frag;WHILE @@FETCH_STATUS = 0BEGIN   PRINT &#39;Executing DBCC INDEXDEFRAG (0, &#39; + RTRIM(@tablename) + &#39;,      &#39; + RTRIM(@indexid) + &#39;) - fragmentation currently &#39;       + RTRIM(CONVERT(varchar(15),@frag)) + &#39;%&#39;;   SELECT @execstr = &#39;DBCC INDEXDEFRAG (0, &#39; + RTRIM(@objectid) + &#39;,       &#39; + RTRIM(@indexid) + &#39;)&#39;;   EXEC (@execstr);   FETCH NEXT      FROM indexes      INTO @tablename, @objectid, @indexid, @frag;END;-- Close and deallocate the cursor.CLOSE indexes;DEALLOCATE indexes;-- Delete the temporary table.DROP TABLE #fraglist;GODBCC INDEXDEFRAG defragments the leaf level of an index so that the physical order of the pages matches the left-to-right logical order of the leaf nodes, therefore improving index-scanning performance.NoteWhen DBCC INDEXDEFRAG is run, index defragmentation occurs serially. This means that the operation on a single index is performed using a single thread. No parallelism occurs. Also, operations on multiple indexes from the same DBCC INDEXDEFRAG statement are performed on one index at a time.DBCC INDEXDEFRAG also compacts the pages of an index, taking into consideration the fill factor specified when the index was created. Any empty pages created because of this compaction are removed. For more information, see Specify Fill Factor for an Index.If an index spans more than one file, DBCC INDEXDEFRAG defragments one file at a time. Pages do not migrate between files.DBCC INDEXDEFRAG reports the estimated percentage completed every five minutes. DBCC INDEXDEFRAG can be stopped at any point in the process, and any completed work is retained.Unlike DBCC DBREINDEX, or the index building operation generally, DBCC INDEXDEFRAG is an online operation. It does not hold locks long term. Therefore, DBCC INDEXDEFRAG does not block running queries or updates. Because the time to defragment is related to the level of fragmentation, a relatively unfragmented index can be defragmented faster than a new index can be built. A very fragmented index might take considerably longer to defragment than to rebuild.The defragmentation is always fully logged, regardless of the database recovery model setting. For more information, see ALTER DATABASE (Transact-SQL). The defragmentation of a very fragmented index can generate more log than a fully logged index creation. However, the defragmentation is performed as a series of short transactions, so a large log is unnecessary if log backups are taken frequently or if the recovery model setting is SIMPLE.RestrictionsDBCC INDEXDEFRAG shuffles index leaf pages in place. Therefore, if an index is interleaved with other indexes on disk, running DBCC INDEXDEFRAG against that index does not make all leaf pages in the index contiguous. To improve the clustering of pages, rebuild the index.DBCC INDEXDEFRAG cannot be used to defragment the following indexes:      A disabled index.        An index with page locking set to OFF.        A spatial index.  DBCC INDEXDEFRAG is not supported for use on system tables.                                                                                                  Old XP Defragmentation, Page Splitting, Web Matrix Defrag.  ",
      "url"      : "//2018-02-25-post-Defrag-SQL/",
      "date"     : "2018-02-25 17:16:01 -0500"
    },
  
    {
      "title"    : "Mobile Colorbox",
      "category" : "Programing",
      "content"	 : "         Mobile First ColorboxMobile First Responsive Colorbox Window to open a link, div, code, about anything. Including a iframe using external data.Using the provided code works with, Jquery 3.3.2 and Bootstrap 4 beta 3.Colorbox if you have not used it was created by Jack MooreI created a colorbox window for ASP.Net Core 2 app. On most Phone and Tablets, no matter the orientation Colorbox was way to small about 40% of the view.On orientation change it flickered and tried to change sizes several times.I searched around and found similar posts and came up with a small addition to the Initialization of colorbox.Colorbox now is working perfect on my Android and some other phone’s I have tried. It now makes the colorbox windows 90% of the view on a normal website, and 90% on mobile.I am building Mobile First sites now and it way to easy with Core 2 framework, with a Mobile First Agency Theme based on Bootstrap 4 beta 3 using colorbox for some internal views.Click to open the Page Code block or anything in a Colorbox Window.To use the Colorbox window by clicking a link that uses a class as class=”inline” and link it to the div with href=”#profiles”&amp;lt;/div&amp;gt;&amp;lt;a class=&quot;inline&quot; href=&quot;#profiles&quot; title=&quot;Colorbox&quot;&amp;gt;Click to open in a Colorbox Window.&amp;lt;/a&amp;gt;    Hide Content in a hidden div class=”hidden”The css for hidden.hidden{display:none}The link is to a div with id=”profiles”Add Colorbox Content in the div with profilesThe Inline Code for inline code.$(&quot;.inline&quot;).colorbox({    inline: !0,    width: &#39;100%&#39;,    rel: &#39;proflex&#39;});$(&#39;.inline_content&#39;).on(&#39;click&#39;, function() {    $.fn.colorbox.prev()});$(&#39;.inline_content&#39;).on(&#39;click&#39;, function() {    $.fn.colorbox.next()});Below is the changed javascript  with additions highlighted.The Javascript  $(&quot;.group1&quot;).colorbox({    rel: &quot;group1&quot;  });  $(&quot;.group2&quot;).colorbox({    rel: &quot;group2&quot;,    transition: &quot;fade&quot;  });  $(&quot;.group3&quot;).colorbox({    rel: &quot;group3&quot;,    transition: &quot;none&quot;,    width: &quot;80%&quot;,    height: &quot;80%&quot;  });  $(&quot;.group4&quot;).colorbox({    rel: &quot;group4&quot;,    slideshow: true  });  $(&quot;.ajax&quot;).colorbox();  $(&quot;.youtube&quot;).colorbox({    iframe: true,    innerWidth: 640,    innerHeight: 390  });  $(&quot;.vimeo&quot;).colorbox({    iframe: true,    innerWidth: 500,    innerHeight: 409  });  $(&quot;.iframe&quot;).colorbox({    iframe: true,    width: &quot;80%&quot;,    height: &quot;80%&quot;  });  $(&quot;.inline&quot;).colorbox({    inline: true,    width: &quot;80%&quot;  });  $(&quot;.callbacks&quot;).colorbox({    onOpen: function () {      alert(&quot;onOpen: colorbox is about to open&quot;);    },    onLoad: function () {      alert(&quot;onLoad: colorbox has started to load the targeted content&quot;);    },    onComplete: function () {      alert(&quot;onComplete: colorbox has displayed the loaded content&quot;);    },    onCleanup: function () {      alert(&quot;onCleanup: colorbox has begun the close process&quot;);    },    onClosed: function () {      alert(&quot;onClosed: colorbox has completely closed&quot;);    }  });  $(&quot;.non-retina&quot;).colorbox({    rel: &quot;group5&quot;,    transition: &quot;none&quot;  });  $(&quot;.retina&quot;).colorbox({    rel: &quot;group5&quot;,    transition: &quot;none&quot;,    retinaImage: true,    retinaUrl: true  });  $(&quot;#click&quot;).click(function () {    $(&quot;#click&quot;).css({      &quot;background-color&quot;: &quot;#f00&quot;,      color: &quot;#fff&quot;,      cursor: &quot;inherit&quot;    }).text(&quot;Open this window again and this message will still be here.&quot;);    return false;  });  var resizeTimer;  //Mobile Resize Function  function resizeColorBox() {    if (resizeTimer) clearTimeout(resizeTimer);    resizeTimer = setTimeout(function () {      if (jQuery(&quot;#cboxOverlay&quot;).is(&quot;:visible&quot;)) jQuery.colorbox.resize({        width: &quot;90%&quot;,        height: &quot;90%&quot;      });    }, 300);  }  jQuery(window).resize(resizeColorBox);  window.addEventListener(&quot;orientationchange&quot;, resizeColorBox, false);                                                                                                  Colorbox HTML, Colorbox Images, Colorbox Logon.  ",
      "url"      : "//2018-02-25-post-Mobile-Colorbox/",
      "date"     : "2018-02-25 16:16:01 -0500"
    },
  
    {
      "title"    : "SQL Fragmentation",
      "category" : "Programing",
      "content"	 : "         IntroductionThis T-SQL sample script illustrates how to check index fragmentation of a specified database in SQL Server.From: http://gallery.technet.microsoft.com/scriptcenter/Check-SQL-Server-a-a5758043#contentA Dynamic CMS using SQL Server most always has fragmentation. When files or data are in the wrong place then SQL Server has to spend time looking for the missing data, slowing the whole process down and increasing load times for your siteScenariosThis script can be used for checking index fragmentation percentage of tables in SQL Server user databases. You can specify the database name and fragmentation percent, after you run the script, you will get the result.ScriptThe following steps use SQL Server 2008 R2 and AdventureWorks2008 sample database as example.Step 1. Open Microsoft SQL Server 2008 R2Step 2. Open Microsoft SQL Server Management StudioStart- All programs- Microsoft SQL Server 2008 R2- Microsoft SQL Server Management StudioStep 3. Drag the script file to SQL Server Management StudioStep 4. Replace the following information with yours in the scriptindexstats.avg_fragmentation_in_percent: In the script the  indexstats.avg_fragmentation_in_percent is greater than 30. Please specify the percent.Step 5. Run the scriptThe below script selects AdventureWorks2008. After the script executing, we will get a result as the following figure shows:Web Matrix is what I use to check Fragmentation.Open Web Matrix select databases and logon to your database, Select new query and paste IndexDefrag query in workspace the execute.Here is my result on a database that is less than a month old. Media Library is 87% FRAGMENTED.Additional ResourcesSee My post on how to fix this at: Defrag SQlSQL query performance might decrease when the SQL Server Database instance has high index fragmentationDownload this script .zip fileCheck Index Defragmentation.                                                                                                  Old XP Defragmentation, Page Splitting, Web Matrix Defrag.  ",
      "url"      : "//posts/2018-02-23-post-SQL-Fragmentation/",
      "date"     : "2018-02-23 20:16:01 -0500"
    },
  
    {
      "title"    : "Reviews",
      "category" : "",
      "content"	 : "                                                             &amp;nbsp;January 2, 2017                                      &amp;nbsp;less 1 minute read                                                      Site ReviewsExternal Reviews site, used for Google Positioning Micro data. Using Staticman’s Popcorn Github repo to push reviews from my external popcorn site to my Root site donboulton.com. This is still a work in progress so Leave a Review for any page in donboulton.com and It will show up as a review on that page.",
      "url"      : "//posts/2017-01-02-post-reviews-external/",
      "date"     : "2017-01-02 17:16:01 -0500"
    },
  
    {
      "title"    : "Devil as Satan",
      "category" : "Creation",
      "content"	 : "         Devil as SatanThe Devil as SatanIn the beginning of time, consideration, thought and action, was the beginning of instant self realization by our Father.God our Father and the Father of all that we will know defeated  the lesser gods, Creation of Allcreation&amp;lt;/a&amp;gt;creating consideration within thy Father of his works, and that evil of having to defend and/or put down, &quot;within&quot;, the lesser gods, thus Satan was of thy father.This first consideration of our Father, is a reflection of thyself. A, &quot;depiction&quot;, see arts and paying attention of self within the mirror, he - him was born. He saw what he was before awakening and all that had been since, what was, He the Holy Spirit, and what will be, Him was Satan,and the, &quot;I&quot;, which is and will always be of our Father.Two Spirits as highest Angles, below and within the trinity, they were formalized as right and left hand Spiritual Angles. Satan was this reflection thy father saw in himself, as the substance of the lesser gods, and who better that him to be the ultimate tester of creation by being the controller of the substance.The Light gave life and is of knowledge, only life matters, &quot;what you take you must restore&quot;, was Fathers truth, life again to the lesser gods. The Light was the test of the knowledge of life, was of test of Angles and then Men so Amen, see what is Amon, to Amen - RA, is his name.The light showed thy Father&#39;s reflection as all of creation is a reflection of thy Father God, without light how do you see the depiction in the mirror, and differentiation&#39;s within self thus it was of all. The two Angles, thus held and give to us, &quot;what is, &quot;The Substance&quot; Satan. And the how to know it, the light Amen, &quot;as the giver or holder&quot;, of, &quot;Knowledge&quot;.Thus the two testers now were, the substance was controlled and Of Satan and checked by the Conception to consideration of my Son Jesus, &quot;Jesus is the now and Future all life&quot;, as he is thy father&#39;s only now or I within the Trinity as of thy Father, &amp;amp; the future of all substance.The Light, Amen was of knowledge and checked by the Holy Ghost as all that was or will be is of and held, as it will be always, by and of the Holy Ghost holding and recording all things in Gods Books Of Life.The trinity and its Workers = US. United State&#39;s Of All.  Six Spirits &amp;amp; ways, was now of thy Father.Angels BriefThe Devil and Amen are to do thy Fathers will, to deceive the Angles and Men.And following orders, to affect the substance and knowledge of man, as thy Father has, &quot;actors&#39; see art, to deceive and manipulate you away form thy spirit&quot;.The a spark, a split, within the two Spirit Angel&#39;s, had to do with the conception and creation of other Angles. God swayed by the Nature of Amen is now Amon, as Amore, he is life more. Conceived by Father, &quot;and they were&quot;, many lesser Angles were formed a mix of Satan and Amon, many and diverse abilities to know and manipulate substances they were.Some just were and Satisfied, &amp;amp; closed to thy Fathers,Arch or higher Angels.Some sought knowledge, those works and ways, &quot;they questioned thy Father Middle Workers Of Amon.Some could only become, to create and procreate, and more was their curse. Creation within the substance was formed by the more, mixing substances with light life, and our universe was formed.The Angles of more had done good, although God&#39;s grace was not upon them, he liked not what they did.Conception of  Man.Then Father a thought of Man and the Seventh Spirit was formed, but not yet formalized in life.Seven Spirits and heavy ways, were of thy Father.Satan then became The Devil, falling from grace of the WE when he questioned of Man, = our accuser. Satan was then cast down with the Angels of more, only to affect Earth and Man. Lowered Angles.Amon was preferred and the light ruled all heavens. Thus the substance was limited and lifeless without the power of Light, Light of Amon.In 995 years the books are opened and Judgments for thy works from Man&#39;s Books of Life; and thy spirit book, God&#39;s Book of life, held by the Holy Sp-I-r-I-t of what was, when loosened and compared before thy Father and Judgment fall&#39;s. Then, &quot;can we,&quot; take these reflections and inner burdens from thy Father and finally all is of the I? Can We?So all the Angels and creation within our universe is simply as a test to see who is worthy, and go beyond. The test to becoming beyond the substance, but to, &quot;see or be&quot;, &amp;amp;/or for your need of the light. Thus life consumed with the substance and the light, knows not of the spirit of Father. SO Deny thyself my Angel&#39;s and men find the truth and self which is of thy Father&#39;s and become the we not the I. As the, &quot;I,&quot; once again, within life&#39;s substance is a lie.Devil Defined in the BibleBible notes and explanations below.Rev 12:9 And the great dragon was cast out, that old serpent, called the Devil, and Satan, which deceiveth the whole world: he was cast out into the earth, and his angels were cast out with him.Rev 12:10 And I heard a loud voice saying in heaven, Now is come salvation, and strength, and the kingdom of our God, and the power of his Christ: for the of our brethren is cast down, which accused them before our God day and nightIt is clear the Devil works for thy father. Works are noted and found to be of some value by our father, lets take the Book of Job as an example.Below we note that Job has been blessed for his works and the devil is pointing this out and that Our Father approves of this.Job 1:6 Now there was a day when the sons of God came to present themselves before the LORD, and Satan came also among them.Job 1:7 And the LORD said unto Satan, Whence comest thou? Then Satan answered the LORD, and said, From going to and fro in the earth, and from walking up and down in it.Job 1:8 And the LORD said unto Satan, Hast thou considered my servant Job, that there is none like him in the earth, a perfect and an upright man, one that feareth God, and escheweth evil?Job 1:9 Then Satan answered the LORD, and said, Doth Job fear God for nought?Job 1:10 Hast not thou made an hedge about him, and about his house, and about all that he hath on every side? thou hast blessed the work of his hands, and his substance is increased in the land.Job 1:11 But put forth thine hand now, and touch all that he hath, and he will curse thee to thy face.Job 1:12 And the LORD said unto Satan, Behold, all that he hath is in thy power; only upon himself put not forth thine hand. So Satan went forth from the presence of the LORD.And following orders to affect the substance of the flesh of man, as thy father has actors to affect the substance.Job 2:7 So went Satan forth from the presence of the LORD, and smote Job with sore boils from the sole of his foot .",
      "url"      : "//2009-02-22-post-devil-satan/",
      "date"     : "2009-02-22 17:16:01 -0500"
    }
  
]


